
<%@ page contentType="text/html;charset=UTF-8" %>

    <ul >
      <li>Servlets - спеціальні класи Java для мережевих задач
        Робота з сервлетами вимагає встановлення servlet-api
        <!-- https://mvnrepository.com/artifact/javax.servlet/javax.servlet-api -->
        Для веб-розробки частіше за все береться нащадок HttpServlet
        HttpServlet - можна вважати аналогом контроллера у версі API/li>
      <li>Після складання сервлет треба зареєструвати. Є два способи (без ІоС)
      - через налаштування сервера web.xml
      - за допомогою анотацій (servlet-api 3 та вище)</li>
      <li>Через web.xml
        "+" централізовані декларації - усі в одному місці
        гарантований порядок декларацій
        сумісність зі старими технологіями
        "-" більш громіздкі інструкції</li>
    </ul>
