<%--
  Created by IntelliJ IDEA.
  User: Пользователь
  Date: 03.09.2023
  Time: 14:24
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>

<div style="margin: 50px">
<img style="margin-left: 10%" src="img/url.PNG"/>
<p><b>Схема (Scheme):</b>Це перший компонент URL і вказує на протокол зв'язку, який використовується для доступу до ресурсу.
    Зазвичай це "http" або "https", але може бути іншими, такими як "ftp" або "mailto".
    </br> Приклади: </br>
    http:// </br>
    https://</p>
<p><b>Авторитет (Authority):</b>Цей компонент включає інформацію про мережевий авторитет, такий як доменне ім'я сервера і (опціонально) номер порту.
    Він включає в себе два підкомпоненти:</br>
    Доменне ім'я (Host): Це ім'я сервера, на якому розміщений ресурс. Наприклад, "www.example.com" або IP-адреса сервера.</br>
    Порт (Port): Це опціональний номер порту, який вказує, на якому порту слухається сервер. Зазвичай для HTTP використовується порт 80, а для HTTPS - порт 443.
</p>
<p><b>Шлях (Path):</b>Цей компонент вказує на шлях до конкретного ресурсу на сервері. Він починається з символу "/",
    і це може бути каталогова структура або ідентифікатор ресурсу на сервері.
    Приклади:</br>
    /products/mobile-phones</br>
    /about/us</p>
<p><b>Запит (Query):</b>Цей компонент дозволяє передавати додаткові параметри запиту на сервер. Він починається з символу "?",
    і містить ключ-значення пари, розділені символом "&". Параметри допомагають передавати інформацію на сервер. </br>
    Приклад:</br>
    ?category=smartphones&page=2</p>
<p><b>Фрагмент (Fragment): </b>Цей компонент дозволяє посилатися на конкретний фрагмент або розділ сторінки.
    Він починається з символу "#", і вказує на ідентифікатор елемента сторінки. Фрагмент не відправляється на
    сервер і використовується лише клієнтом для навігації на сторінці. </br>
    Приклад:</br>
    #section-3</p>

    <h5>Отже, загальна структура URL виглядає так:</h5>
    <h3>[scheme]://[authority][path]?[query]#[fragment]</h3>
    <p><b>Приклади URL з усіма компонентами:</b></br>

        https://www.example.com:8080/products?category=smartphones#section-3</br>
        ftp://ftp.example.com/files/report.pdf</br>
        mailto:john.doe@example.com</p>
</div>